{
  "users": [
    {
      "id": 1,
      "title": "React Native Developer",
      "name": "Nikhil Kumar",
      "label": "Hello World",
      "FooterParagraph": "I'm always open to discussing new projects, creative ideas, or opportunities to be part of your visions. Feel free to reach out through any of the platforms below or send me a message.",
      "description": [
        "I am a passionate React Native Developer, specializing in building mobile applications for Android and iOS. My focus is on delivering scalable, efficient, and user-friendly mobile solutions powered by Firebase for authentication, real-time databases, and cloud storage. React Native is not just my skill—it's my passion, and I continuously strive to grow in this field to deliver high-quality mobile experiences.",
        "In addition to mobile app development, I also have experience with React.js for web applications and an interest in UI/UX design, ensuring intuitive and engaging digital interfaces. I am skilled in JavaScript for creating dynamic user experiences and proficient in Firebase integration. While React.js and UI/UX are areas of interest, my primary passion and expertise remain in React Native mobile development."
      ],
      "profileURL": "https://raw.githubusercontent.com/Nikhil-4484/portfolio/main/assets/profileUrl/IMG_0200.jpg",
      "skillLabel": "Technical Skills",
      "AnimationDots": 25,
      "skillDescription": "With a strong foundation in modern web and mobile technologies, I specialize in creating seamless cross-platform experiences. My expertise in React Native and Firebase enables me to build scalable, real-time applications that deliver exceptional user experiences across iOS and Android platforms.",

      "skills": [
        {
          "name": "Android",
          "iconUrl": "https://raw.githubusercontent.com/Nikhil-4484/portfolio/main/assets/techIcons/Android.png"
        },
        {
          "name": "Apple",
          "iconUrl": "https://raw.githubusercontent.com/Nikhil-4484/portfolio/main/assets/techIcons/Apple.png"
        },
        {
          "name": "TypeScript",
          "iconUrl": "https://raw.githubusercontent.com/Nikhil-4484/portfolio/main/assets/techIcons/TypeScript.png"
        },
        {
          "name": "Firebase",
          "iconUrl": "https://raw.githubusercontent.com/Nikhil-4484/portfolio/main/assets/techIcons/Firebase.png"
        },
        {
          "name": "Git",
          "iconUrl": "https://raw.githubusercontent.com/Nikhil-4484/portfolio/main/assets/techIcons/Git.png"
        },
        {
          "name": "GoogleCloud",
          "iconUrl": "https://raw.githubusercontent.com/Nikhil-4484/portfolio/main/assets/techIcons/GoogleCloud.png"
        },
        {
          "name": "Redux",
          "iconUrl": "https://raw.githubusercontent.com/Nikhil-4484/portfolio/main/assets/techIcons/Redux.png"
        },
        {
          "name": "TailwindCSS",
          "iconUrl": "https://raw.githubusercontent.com/Nikhil-4484/portfolio/main/assets/techIcons/TailwindCSS.png"
        }
      ],
      "careerPathway": [
        {
          "type": "experience",
          "title": "React Native Developer",
          "organization": "Sprinzo Developers",
          "period": "Current Position",
          "description": "Currently building scalable mobile and web applications with a strong focus on performance, design, and user experience. Leading the development of new features across React Native (mobile) and React.js (web) platforms, integrating Firebase for real-time data and authentication. Additionally, working on AI-powered functionalities to enhance automation and user engagement, while mentoring junior developers in React and React Native best practices."
        }
      ],
      "projects": [
        {
          "id": 10,
          "projectIconURL": null,
          "project_Name": "PG Management System (Admin · Manager · Guest Apps)",
          "role": "Frontend + Firebase backend",
          "description": [
            "A role-based PG (Paying Guest) Management System built with React Native + Firebase, designed to efficiently manage buildings, rooms, managers, guests, and complaints across multiple properties with real-time synchronization and push notifications.",
            "The system consists of three separate mobile applications: Admin App – Full control & management, Manager App – Building & guest operations and Guest App – Stay management & complaint submission"
          ],
          "skills": [
            "React Native",
            "JavaScript",
            "Firebase",
            "Firebase Cloud Firestore",
            "Cloud Functions"
          ],
          "image": "https://raw.githubusercontent.com/Nikhil-4484/portfolio/main/assets/pg/pg.jpg",
          "link": null
        },
        {
          "id": 11,
          "projectIconURL": "https://raw.githubusercontent.com/Nikhil-4484/portfolio/main/assets/mutoo/mutoo_icon.png",
          "project_Name": "Mutoo - Smart Ride Sharing for Drivers",
          "role": "Frontend + Firebase backend",
          "description": [
            "Mutoo is a modern ride-sharing app for car drivers, enabling secure registration with name, phone number, car license, and face verification. Drivers can create rides for present or future trips, while users apply filters to find nearby rides efficiently. An integrated chat system supports smooth driver-passenger communication.",
            "The backend uses Firebase Firestore for real-time data, Firebase Messaging for instant notifications, and Firebase Storage for secure file handling, delivering a scalable and reliable platform."
          ],
          "skills": [
            "React Native",
            "JavaScript",
            "Firebase",
            "Firebase Cloud Firestore",
            "Cloud Functions"
          ],
          "image": "https://raw.githubusercontent.com/Nikhil-4484/portfolio/main/assets/mutoo/Screenshot%202025-11-10%20200026.png",
          "link": "https://mutoo.app/"
        },
        {
          "id": 12,
          "projectIconURL": "https://raw.githubusercontent.com/Nikhil-4484/portfolio/refs/heads/main/assets/BossetteHair/IMG_0128.AVIF",
          "project_Name": "BossetteHair – Hair & Beauty E-commerce App",
          "role": "React Native Developer",
          "description": [
            "Worked on a hair and beauty product selling app called BossetteHair, focused on premium hair extensions, wigs (\"hair dummy\"), and hair care products under the tagline \"Hair Store for Boss Women.\"",
            "I contributed by developing new UI screens to showcase additional product categories, improving the user navigation and shopping experience. My work helped enhance the app’s visual appeal and expanded product visibility for better conversions."
          ],
          "skills": [
            "Cross-Platform Development",
            "Build and Deployment",
            "JavaScript"
          ],
          "image": "https://raw.githubusercontent.com/Nikhil-4484/portfolio/main/assets/BossetteHair/BossetteHair.png",
          "link": "https://bossettehair.com/"
        },
        {
          "id": 13,
          "projectIconURL": "https://raw.githubusercontent.com/Nikhil-4484/portfolio/main/assets/thecraftiq/craftlogo.png",
          "project_Name": "CRAFTIQ",
          "role": "Mobile App and web Developer",
          "description": [
            "Debugged major issues causing crashes and build failures. Solved critical error preventing APK generation, enabling successful app deployment. Ensured full functionality on both iOS and Android platforms. Collaborated with the team to maintain cross-platform compatibility and app performance.",
            "Web: Developed an interactive popup feature in the myCraft screen for sharing recipes via email. Implemented a multi-step flow allowing users to add one or more Recipes, select multiple Recipients, and customize the Subject and Body before sending. Ensured seamless user experience with dynamic validation, responsive design, and smooth data handling between frontend and backend. Enhanced user engagement by simplifying the recipe-sharing process with clear, guided steps."
          ],
          "skills": [
            "Debugging & Troubleshooting",
            "Cross-Platform Development",
            "Build and Deployment",
            "JavaScript",
            "React.js"
          ],
          "image": "https://raw.githubusercontent.com/Nikhil-4484/portfolio/main/assets/thecraftiq/thecraftiq-photo.png",
          "link": "https://thecraftiq.com/"
        },
        {
          "id": 14,
          "projectIconURL": "https://raw.githubusercontent.com/Nikhil-4484/portfolio/refs/heads/main/assets/donotsign/appicon.png",
          "project_Name": "DoNotSign",
          "role": "Frontend, Backend & Cloud",
          "description": [
            "DoNotSign is an AI-powered contract review mobile application designed to help users make informed decisions before signing legal documents. Users can upload or scan contracts in multiple formats (PDF, images, documents), and the app uses AI to analyze the content, detect potential risks, highlight unfavorable clauses, and summarize key terms in plain language.",
            "The application provides risk scoring with color-coded indicators, actionable recommendations such as Sign, Negotiate, or Do Not Sign, and maintains a secure contract history for future reference. Privacy and data security are prioritized through encrypted document storage and secure processing.",
            "This project demonstrates end-to-end mobile application development, UI/UX design, native integrations, performance optimization, and AI-driven workflows."
          ],
          "skills": [
            "React Native",
            "TypeScript",
            "Animations (Lottie, Reanimated)",
            "Firebase",
            "Firestore",
            "Cloud Functions",
            "AI Integration",
            "Gemini AI (Gamani AI)",
            "iOS & Android Build Management"
          ],
          "image": "https://raw.githubusercontent.com/Nikhil-4484/portfolio/refs/heads/main/assets/donotsign/donotsign.jpg",
          "link": null
        }
         {
          "id": 15,
          "projectIconURL": "https://raw.githubusercontent.com/Nikhil-4484/portfolio/refs/heads/main/assets/donotsign/appicon.png",
          "project_Name": "DoNotSign – AI-Powered Contract Review Web Platform",
          "role": "Frontend, Backend & Cloud",
          "description": [
            "DoNotSign Web is a modern AI-powered contract review platform built using React.js, Vite, and TypeScript, designed to help users analyze legal documents directly from their browser before signing.",
            "The website allows users to upload contracts in multiple formats (PDF, images, documents) and leverages advanced AI models to: Detect potential legal risks, Highlight unfavorable clauses, Summarize complex terms into plain, easy-to-understand language, Provide intelligent risk scoring with color-coded indicators and Offer actionable recommendations such as Sign, Negotiate, or Do Not Sign",
            "Modern frontend architecture with React.js + Vite + TypeScript with Clean and responsive UI/UX design and AI-driven document analysis workflows. Firebase & Firestore integration for real-time data management and Cloud Functions for secure backend processing Performance optimization and scalable architecture"
          ],
          "skills": [
            "React.JS",
            "TypeScript",
            "Animations ",
            "Firebase",
            "Firestore",
            "Cloud Functions",
            "AI Integration",
            "Gemini AI (Gamani AI)",
          ],
          "image": "https://raw.githubusercontent.com/Nikhil-4484/portfolio/refs/heads/main/assets/donotsign/donotsign_web.PNG",
          "link": "https://donotsign.com/"
        }
      ]
    }
  ]
}

